In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df1 = pd.read_csv('user_demographics.csv')
df2 = pd.read_csv('User_product_purchase_details_p2.csv')

In [6]:
ds = pd.merge(df2,df1,right_on='User_ID',left_on='User_ID')

In [7]:
ds[:5]

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender,Age,Occupation
0,1000001,P00069042,A,2,0,3,NaN,NaN,8370,F,0-17,10
1,1000001,P00248942,A,2,0,1,6.0,14.0,15200,F,0-17,10
2,1000001,P00087842,A,2,0,12,NaN,NaN,1422,F,0-17,10
3,1000001,P00085442,A,2,0,12,14.0,NaN,1057,F,0-17,10
4,1000002,P00285442,C,4+,0,8,NaN,NaN,7969,M,55+,16

In [8]:
#spliting the age range into int(age)

ds['start']=ds['Age'].str.split('-').str[0]

ds['end']=ds['Age'].str.split('-').str[1]
 
#+ is present so replace

ds['start']=ds['start'].str.replace('+','',regex=False)
 
#for null val in end of range replace with start 

ds['end']=ds['end'].fillna(ds['start'])
 
#convert to int datatype

ds['start']=ds['start'].astype(int)

ds['end']=ds['end'].astype(int)
 
#finding median

ds['Age']=(ds['start']+ds['end'])/2

#drop the temp col

ds.drop(['start','end'],axis=1,inplace=True)

ds["Age"]=ds['Age'].astype(int)

In [9]:
ds['Stay_In_Current_City_Years'] = ds['Stay_In_Current_City_Years'].str.rstrip('+')

In [10]:
ds['Stay_In_Current_City_Years'] = ds['Stay_In_Current_City_Years'].astype(int)

In [11]:
ds['Product_Category_2'] = ds['Product_Category_2'].fillna(0)

In [12]:
ds['Product_Category_2'] = ds['Product_Category_2'].astype(int)

In [13]:
ds['Product_Category_3'] = ds['Product_Category_3'].fillna(0)

In [14]:
ds['Product_Category_3'] = ds['Product_Category_3'].astype(int)

In [15]:
ds = ds.drop(ds[ds['Age']<18].index)

In [16]:
ds['Product_Category'] = ds[['Product_Category_1','Product_Category_2','Product_Category_3']].sum(axis=1)

In [17]:
ds = ds.drop(ds[['Product_Category_1','Product_Category_2','Product_Category_3']],axis=1)

In [18]:
ds[:5]

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Purchase,Gender,Age,Occupation,Product_Category
4,1000002,P00285442,C,4,0,7969,M,55,16,8
5,1000003,P00193542,A,3,0,15227,M,30,15,3
6,1000004,P00184942,B,2,1,19215,M,48,7,26
7,1000004,P00346142,B,2,1,15854,M,48,7,16
8,1000004,P0097242,B,2,1,15686,M,48,7,17

In [19]:
gender_num = {'M':1,'F':0}
ds['Gender'] = ds['Gender'].map(gender_num)

In [20]:
city_cat = {'A':1,'B':2,'C':3}
ds['City_Category'] = ds['City_Category'].map(city_cat)

In [21]:
x = ds.iloc[:,[2,3,4,6,7,8,5]]

In [22]:
x.corr()

,City_Category,Stay_In_Current_City_Years,Marital_Status,Gender,Age,Occupation,Purchase
City_Category,1.000000,0.022326,0.049052,-0.007838,0.144111,0.035480,0.063579
Stay_In_Current_City_Years,0.022326,1.000000,-0.014514,0.014211,-0.008739,0.029771,0.005959
Marital_Status,0.049052,-0.014514,1.000000,-0.016950,0.289510,0.027196,-0.002060
Gender,-0.007838,0.014211,-0.016950,1.000000,-0.018560,0.119097,0.059282
Age,0.144111,-0.008739,0.289510,-0.018560,1.000000,0.107020,0.013374
Occupation,0.035480,0.029771,0.027196,0.119097,0.107020,1.000000,0.022024
Purchase,0.063579,0.005959,-0.002060,0.059282,0.013374,0.022024,1.000000

In [23]:
ds.reset_index()

,index,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Purchase,Gender,Age,Occupation,Product_Category
0,4,1000002,P00285442,3,4,0,7969,1,55,16,8
1,5,1000003,P00193542,1,3,0,15227,1,30,15,3
2,6,1000004,P00184942,2,2,1,19215,1,48,7,26
3,7,1000004,P00346142,2,2,1,15854,1,48,7,16
4,8,1000004,P0097242,2,2,1,15686,1,48,7,17
...,...,...,...,...,...,...,...,...,...,...,...
534961,550063,1006033,P00372445,2,1,1,368,1,53,13,20
534962,550064,1006035,P00375436,3,3,0,371,0,30,1,20
534963,550065,1006036,P00375436,2,4,1,137,0,30,15,20
534964,550066,1006038,P00375436,3,2,0,365,0,55,1,20
534965,550067,1006039,P00371644,2,4,1,490,0,48,0,20

In [24]:
x = ds.iloc[:,[2,3,4,6,7,8]]

In [25]:
y = ds.iloc[:,5]

In [26]:
y[:5]

4     7969
5    15227
6    19215
7    15854
8    15686
Name: Purchase, dtype: int64

In [65]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_absolute_error, r2_score, precision_score, accuracy_score, mean_squared_error
from sklearn.model_selection import train_test_split

In [28]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.3,random_state=123)

In [29]:
rf = RandomForestRegressor()

In [30]:
ytrain[:5]

290420     1956
481851     6924
416609    19489
455075     7581
32530      6144
Name: Purchase, dtype: int64

In [31]:
model = rf.fit(xtrain,ytrain)

In [32]:
Pred = model.predict(xtest)

In [33]:
mean_absolute_error(ytest,Pred)

3938.156897689852

In [34]:
r2_score(ytest,Pred)

0.04345247274101982

In [35]:
mean=ds['Purchase'].mean()
def voucher(purchase):
    if purchase > mean:
         dis=purchase*0.25
         return purchase-dis
    else:
        return purchase
ds['After_discount']=ds['Purchase'].apply(voucher)

In [36]:
ds[:5]

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Purchase,Gender,Age,Occupation,Product_Category,After_discount
4,1000002,P00285442,3,4,0,7969,1,55,16,8,7969.00
5,1000003,P00193542,1,3,0,15227,1,30,15,3,11420.25
6,1000004,P00184942,2,2,1,19215,1,48,7,26,14411.25
7,1000004,P00346142,2,2,1,15854,1,48,7,16,11890.50
8,1000004,P0097242,2,2,1,15686,1,48,7,17,11764.50

In [38]:
dj = ds.groupby('User_ID').agg({
    'Stay_In_Current_City_Years': 'first',
    'Purchase': 'sum',
    'Age': 'first',
    'Occupation': 'first',
    'Product_Category': 'sum',
    'After_discount': 'sum'
}).reset_index()

In [39]:
dj[:5]

,User_ID,Stay_In_Current_City_Years,Purchase,Age,Occupation,Product_Category,After_discount
0,1000002,4,810472,55,16,1252,661163.0
1,1000003,3,341635,30,15,358,277406.0
2,1000004,2,206468,48,7,262,155933.5
3,1000005,1,821001,30,20,1508,731065.5
4,1000006,1,379930,53,9,874,320093.0

In [40]:
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [46]:
model_sum = sm.OLS(y,x).fit()

In [47]:
print(model_sum.summary())

                                 OLS Regression Results
=======================================================================================
Dep. Variable:               Purchase   R-squared (uncentered):                   0.752
Model:                            OLS   Adj. R-squared (uncentered):              0.752
Method:                 Least Squares   F-statistic:                          2.697e+05
Date:                Fri, 04 Oct 2024   Prob (F-statistic):                        0.00
Time:                        16:31:26   Log-Likelihood:                     -5.3422e+06
No. Observations:              534966   AIC:                                  1.068e+07
Df Residuals:                  534960   BIC:                                  1.068e+07
Df Model:                           6
Covariance Type:            nonrobust
==============================================================================================
                                 coef    std err          t      P>|t|      [0.025      0.975]
----------------------------------------------------------------------------------------------
City_Category               1399.2950      8.513    164.377      0.000    1382.610    1415.980
Stay_In_Current_City_Years   373.1243      5.335     69.936      0.000     362.667     383.581
Marital_Status              -136.2085     15.204     -8.959      0.000    -166.008    -106.409
Gender                      2052.8965     15.713    130.646      0.000    2022.099    2083.694
Age                          103.6699      0.591    175.376      0.000     102.511     104.828
Occupation                    39.0020      1.101     35.416      0.000      36.844      41.160
==============================================================================
Omnibus:                    19471.973   Durbin-Watson:                   1.513
Prob(Omnibus):                  0.000   Jarque-Bera (JB):            20951.021
Skew:                           0.470   Prob(JB):                         0.00
Kurtosis:                       2.762   Cond. No.                         81.9
==============================================================================

Notes:
[1] R² is computed without centering (uncentered) since the model does not contain a constant.
[2] Standard Errors assume that the covariance matrix of the errors is correctly specified.

In [48]:
dj[:5]

,User_ID,Stay_In_Current_City_Years,Purchase,Age,Occupation,Product_Category,After_discount
0,1000002,4,810472,55,16,1252,661163.0
1,1000003,3,341635,30,15,358,277406.0
2,1000004,2,206468,48,7,262,155933.5
3,1000005,1,821001,30,20,1508,731065.5
4,1000006,1,379930,53,9,874,320093.0

In [50]:
x1 = dj.iloc[:,[1,3,5,6]]

In [51]:
y1 = dj.iloc[:,2]

In [52]:
y1[:5]

0    810472
1    341635
2    206468
3    821001
4    379930
Name: Purchase, dtype: int64

In [53]:
x_train,x_test,y_train,y_test = train_test_split(x1,y1,test_size=0.2,random_state=123)

In [54]:
from sklearn.tree import DecisionTreeRegressor

In [55]:
dt = DecisionTreeRegressor()

In [56]:
model_dt = dt.fit(x_train,y_train)

In [57]:
Pred_dt = model_dt.predict(x_test)

In [58]:
mean_absolute_error(y_test,Pred_dt)

40400.73215859031

In [59]:
r2_score(y_test,Pred_dt)

0.9816535500111653

In [60]:
model_rf = rf.fit(x_train,y_train)

In [62]:
Pred_rf = model_rf.predict(x_test)

In [63]:
mean_absolute_error(y_test,Pred_rf)

31013.15963876652

In [64]:
r2_score(y_test,Pred_rf)

0.988088564931419